<p>&nbsp;</p>
<div style="max-width: 900px; margin: 0 auto; padding: 20px; background: #f8f9fa;">
<div style="background: white; padding: 30px; border-radius: 12px; box-shadow: 0 2px 10px rgba(0,0,0,0.1); overflow-x: auto;">

<h1 style="text-align: center; color: #2c3e50; margin-top: 0;">Задача 1.6: Метод main</h1>

<div style="background: #e8f5e9; border: 2px solid #4caf50; border-radius: 8px; padding: 14px; margin: 20px 0;">
<h3 style="color: #2e7d32; margin-top: 0;">📌 Цель задачи</h3>
<p style="margin: 0;">Закрепить базовую структуру Java-программы: класс <code>Main</code> и метод <code>public static void main(String[] args)</code>.</p>
</div>

<div style="background: linear-gradient(to right, #ffeaa7, #fdcb6e); border-radius: 8px; padding: 16px; margin: 20px 0;">
<h3 style="color: #2d3436; margin-top: 0;">🎯 Сценарий</h3>
<p style="margin-bottom: 10px;">Вы создаёте первую полноценную Java-программу, которую можно запустить как самостоятельный файл.</p>
<p style="margin: 0;"><strong>Ваша задача:</strong> собрать правильный каркас программы и вывести два приветственных сообщения.</p>
</div>

<h2 style="color: #34495e; margin-top: 28px;">💡 Что нужно знать</h2>

<div style="background: #f0f4f8; border-radius: 8px; padding: 16px; margin: 16px 0;">
<h4 style="color: #455a64; margin-top: 0;">Точка входа</h4>
<p><code>main</code> — это метод, с которого JVM начинает выполнение программы.</p>
<pre style="background: #263238; color: #aed581; padding: 12px; border-radius: 4px; margin: 10px 0;"><code>public class Main {
    public static void main(String[] args) {
        // команды выполняются здесь
    }
}</code></pre>
<p style="margin-bottom: 0;">Имя класса <code>Main</code> и сигнатуру метода нужно записать точно.</p>
</div>

<h2 style="color: #34495e; margin-top: 28px;">📋 Техническое задание</h2>
<p><strong>Напишите программу, которая выводит две строки:</strong></p>

<pre style="background: #2c3e50; color: #ecf0f1; padding: 16px; border-radius: 8px; overflow-x: auto;"><code>Hello Kata Academy!
Hello from my first Java program!</code></pre>

<h2 style="color: #34495e; margin-top: 28px;">🎯 Результат программы</h2>
<p>После запуска программа должна вывести:</p>

<pre style="background: #2c3e50; color: #ecf0f1; padding: 16px; border-radius: 8px; overflow-x: auto;"><code>Hello Kata Academy!
Hello from my first Java program!</code></pre>

<div style="background: #fff3e0; border: 1px solid #ff9800; border-radius: 8px; padding: 14px; margin: 16px 0;">
<h4 style="color: #e65100; margin-top: 0;">🤔 Момент для размышления</h4>
<p style="margin-bottom: 0;">Почему команды вывода должны находиться внутри <code>main</code>, а не просто между строками класса?</p>
</div>

<h2 style="color: #34495e; margin-top: 28px;">📝 Структура программы</h2>
<pre style="background: #263238; color: #aed581; padding: 20px; border-radius: 8px; overflow-x: auto;"><code>public class Main {
    public static void main(String[] args) {
        // 1. Выведите первую строку
        // 2. Выведите вторую строку
    }
}</code></pre>

<h2 style="color: #34495e; margin-top: 28px;">✅ Чек-лист проверки</h2>
<div style="background: #f8f9fa; border-left: 4px solid #28a745; padding: 16px; margin: 16px 0;">
<ul style="margin-bottom: 0;">
	<li><label><input type="checkbox"> Есть класс <code>Main</code></label></li>
	<li><label><input type="checkbox"> Есть метод <code>public static void main(String[] args)</code></label></li>
	<li><label><input type="checkbox"> Внутри <code>main</code> две команды <code>System.out.println</code></label></li>
	<li><label><input type="checkbox"> Порядок строк совпадает с образцом</label></li>
	<li><label><input type="checkbox"> Фигурные скобки открыты и закрыты правильно</label></li>
</ul>
</div>

<div style="background: #fff8e1; border-left: 4px solid #ffc107; padding: 16px; margin: 16px 0;">
<h4 style="color: #f57c00; margin-top: 0;">⚠️ Технические ограничения</h4>
<ul style="margin-bottom: 0;">
	<li>Не используйте переменные, циклы, условия и дополнительные методы</li>
	<li>Не меняйте имя класса <code>Main</code></li>
	<li>Не меняйте сигнатуру метода <code>main</code></li>
	<li>Откажитесь от <code>System.out.print</code>: здесь нужны две отдельные строки</li>
</ul>
</div>

<div style="background: #ffebee; border: 1px solid #ef5350; border-radius: 8px; padding: 14px; margin: 20px 0;">
<h4 style="color: #c62828; margin-top: 0;">🐛 Отладка: если что-то не работает</h4>
<table style="width: 100%; margin-top: 10px;">
	<tbody>
		<tr><td style="padding: 8px; vertical-align: top;"><strong>Программа не запускается?</strong></td><td style="padding: 8px;">→ Проверьте имя класса <code>Main</code> и точную запись <code>main</code></td></tr>
		<tr style="background: #ffebee;"><td style="padding: 8px; vertical-align: top;"><strong>Ошибка со скобками?</strong></td><td style="padding: 8px;">→ У класса и метода должны быть свои пары фигурных скобок</td></tr>
		<tr><td style="padding: 8px; vertical-align: top;"><strong>Вывод в одну строку?</strong></td><td style="padding: 8px;">→ Используйте <code>println</code> для каждой строки</td></tr>
	</tbody>
</table>
</div>

<div style="background: #e8f5e9; border: 1px solid #4caf50; border-radius: 8px; padding: 14px; margin: 20px 0;">
<h4 style="color: #2e7d32; margin-top: 0;">💪 Дополнительный вызов (после сдачи задачи)</h4>
<p style="margin-bottom: 0;">Добавьте третью строку вывода у себя локально и посмотрите, как программа выполняет команды сверху вниз. Перед отправкой верните решение к требованиям задачи.</p>
</div>

<div style="background: #f3e5f5; border: 1px solid #ce93d8; border-radius: 8px; padding: 14px; margin: 20px 0;">
<h4 style="color: #6a1b9a; margin-top: 0;">🎨 Где это пригодится</h4>
<p><strong>Сегодня:</strong> Без <code>main</code> Java не поймёт, откуда начинать выполнение программы.</p>
<p><strong>В проектах:</strong> Точка входа используется в консольных приложениях, утилитах и учебных программах.</p>
<p style="margin-bottom: 0;"><strong>Дальше в курсе:</strong> Внутри <code>main</code> вы будете вызывать методы, создавать переменные и запускать основную логику.</p>
</div>

<div style="background: #e8f5e9; border: 1px solid #4caf50; border-radius: 8px; padding: 14px; margin: 20px 0;">
<h4 style="color: #2e7d32; margin-top: 0;">Критерии приёмки</h4>
<p style="margin-bottom: 0;">Решение считается верным, если результат совпадает с примерами, соблюдены технические ограничения и выполнены пункты чек-листа.</p>
</div>

</div>
</div>
<p>&nbsp;</p>
