<p>&nbsp;</p>
<div style="max-width: 900px; margin: 0 auto; padding: 20px; background: #f8f9fa;">
<div style="background: white; padding: 30px; border-radius: 12px; box-shadow: 0 2px 10px rgba(0,0,0,0.1); overflow-x: auto;">

<h1 style="text-align: center; color: #2c3e50; margin-top: 0;">Задача 1.9: Экранирование строк</h1>

<div style="background: #e8f5e9; border: 2px solid #4caf50; border-radius: 8px; padding: 14px; margin: 20px 0;">
<h3 style="color: #2e7d32; margin-top: 0;">📌 Цель задачи</h3>
<p style="margin: 0;">Научиться выводить строки, внутри которых есть кавычки, обратные слэши и текстовые обозначения специальных символов.</p>
</div>

<div style="background: linear-gradient(to right, #ffeaa7, #fdcb6e); border-radius: 8px; padding: 16px; margin: 20px 0;">
<h3 style="color: #2d3436; margin-top: 0;">🎯 Сценарий</h3>
<p style="margin-bottom: 10px;">Вы выводите справочную информацию: цитату, путь к файлу и подсказку про символ переноса строки.</p>
<p style="margin: 0;"><strong>Ваша задача:</strong> записать строковые литералы так, чтобы специальные символы появились в консоли как обычный текст.</p>
</div>

<h2 style="color: #34495e; margin-top: 28px;">💡 Что нужно знать</h2>

<div style="background: #f0f4f8; border-radius: 8px; padding: 16px; margin: 16px 0;">
<h4 style="color: #455a64; margin-top: 0;">Экранирование</h4>
<p>В Java строка начинается и заканчивается двойными кавычками. Если кавычка нужна внутри строки, перед ней ставят обратный слэш.</p>
<pre style="background: #263238; color: #aed581; padding: 12px; border-radius: 4px; margin: 10px 0;"><code>System.out.println("Он сказал: \"Hello!\"");
System.out.println("Путь: C:\\Java");</code></pre>
<p style="margin-bottom: 0;">Чтобы вывести сам обратный слэш, его тоже нужно экранировать: <code>\\</code>.</p>
</div>

<h2 style="color: #34495e; margin-top: 28px;">📋 Техническое задание</h2>
<p><strong>Напишите программу, которая выводит:</strong></p>

<pre style="background: #2c3e50; color: #ecf0f1; padding: 16px; border-radius: 8px; overflow-x: auto;"><code>Он сказал: "Hello, Java!"
Путь: C:\Java\bin
Перенос строки записывается как: \n</code></pre>

<h2 style="color: #34495e; margin-top: 28px;">🎯 Результат программы</h2>
<p>После запуска вывод должен совпасть с образцом:</p>

<pre style="background: #2c3e50; color: #ecf0f1; padding: 16px; border-radius: 8px; overflow-x: auto;"><code>Он сказал: "Hello, Java!"
Путь: C:\Java\bin
Перенос строки записывается как: \n</code></pre>

<div style="background: #fff3e0; border: 1px solid #ff9800; border-radius: 8px; padding: 14px; margin: 16px 0;">
<h4 style="color: #e65100; margin-top: 0;">🤔 Момент для размышления</h4>
<p style="margin-bottom: 0;">Почему для вывода <code>C:\Java\bin</code> в коде нужно написать больше обратных слэшей, чем видно в консоли?</p>
</div>

<h2 style="color: #34495e; margin-top: 28px;">📝 Структура решения</h2>
<p>Платформа уже содержит класс и метод <code>main</code>. Отправьте только команды вывода.</p>
<pre style="background: #263238; color: #aed581; padding: 20px; border-radius: 8px; overflow-x: auto;"><code>// 1. Выведите строку с кавычками
// 2. Выведите путь с обратными слэшами
// 3. Выведите текстовое обозначение \n</code></pre>

<h2 style="color: #34495e; margin-top: 28px;">✅ Чек-лист проверки</h2>
<div style="background: #f8f9fa; border-left: 4px solid #28a745; padding: 16px; margin: 16px 0;">
<ul style="margin-bottom: 0;">
	<li><label><input type="checkbox"> Используется <code>System.out.println</code></label></li>
	<li><label><input type="checkbox"> Кавычки внутри текста записаны через <code>\"</code></label></li>
	<li><label><input type="checkbox"> Обратные слэши в пути записаны через <code>\\</code></label></li>
	<li><label><input type="checkbox"> В последней строке выводится текст <code>\n</code>, а не реальный перенос внутри строки</label></li>
</ul>
</div>

<div style="background: #fff8e1; border-left: 4px solid #ffc107; padding: 16px; margin: 16px 0;">
<h4 style="color: #f57c00; margin-top: 0;">⚠️ Технические ограничения</h4>
<ul style="margin-bottom: 0;">
	<li>Не используйте переменные и дополнительные методы</li>
	<li>Не разбивайте одну требуемую строку на несколько команд вывода</li>
	<li>Не заменяйте обратный слэш на обычный слэш <code>/</code></li>
	<li>Откажитесь от копирования ожидаемого вывода без экранирования в коде: такой код не скомпилируется</li>
</ul>
</div>

<div style="background: #ffebee; border: 1px solid #ef5350; border-radius: 8px; padding: 14px; margin: 20px 0;">
<h4 style="color: #c62828; margin-top: 0;">🐛 Отладка: если что-то не работает</h4>
<table style="width: 100%; margin-top: 10px;">
	<tbody>
		<tr><td style="padding: 8px; vertical-align: top;"><strong>Ошибка из-за кавычек?</strong></td><td style="padding: 8px;">→ Каждую кавычку внутри текста запишите как <code>\"</code></td></tr>
		<tr style="background: #ffebee;"><td style="padding: 8px; vertical-align: top;"><strong>Пропали слэши?</strong></td><td style="padding: 8px;">→ Для одного видимого <code>\</code> в строке кода нужен <code>\\</code></td></tr>
		<tr><td style="padding: 8px; vertical-align: top;"><strong>Последняя строка перенеслась?</strong></td><td style="padding: 8px;">→ Чтобы вывести <code>\n</code> как текст, используйте <code>\\n</code> в строковом литерале</td></tr>
	</tbody>
</table>
</div>

<div style="background: #e8f5e9; border: 1px solid #4caf50; border-radius: 8px; padding: 14px; margin: 20px 0;">
<h4 style="color: #2e7d32; margin-top: 0;">💪 Дополнительный вызов (после сдачи задачи)</h4>
<p style="margin-bottom: 0;">Попробуйте вывести строку <code>Файл "app.log" лежит в C:\logs\java</code>. Затем верните решение к точному условию задачи.</p>
</div>

<div style="background: #f3e5f5; border: 1px solid #ce93d8; border-radius: 8px; padding: 14px; margin: 20px 0;">
<h4 style="color: #6a1b9a; margin-top: 0;">🎨 Где это пригодится</h4>
<p><strong>Сегодня:</strong> Экранирование помогает корректно записывать строки, которые содержат служебные символы Java.</p>
<p><strong>В проектах:</strong> Оно нужно для путей к файлам, JSON-строк, сообщений с цитатами и текстовых шаблонов.</p>
<p style="margin-bottom: 0;"><strong>Дальше в курсе:</strong> Эти навыки понадобятся при работе со строками, вводом пользователя и форматированием вывода.</p>
</div>

<div style="background: #e8f5e9; border: 1px solid #4caf50; border-radius: 8px; padding: 14px; margin: 20px 0;">
<h4 style="color: #2e7d32; margin-top: 0;">Критерии приёмки</h4>
<p style="margin-bottom: 0;">Решение считается верным, если результат совпадает с примерами, соблюдены технические ограничения и выполнены пункты чек-листа.</p>
</div>

</div>
</div>
<p>&nbsp;</p>
