<p>&nbsp;</p>
<div style="max-width: 900px; margin: 0 auto; padding: 20px; background: #f8f9fa;">
<div style="background: white; padding: 30px; border-radius: 12px; box-shadow: 0 2px 10px rgba(0,0,0,0.1); overflow-x: auto;">

<h1 style="color: #2c3e50; border-bottom: 3px solid #3498db; padding-bottom: 10px;">Задача 1.6: Метод main</h1>

<p style="font-size: 18px; color: #555; margin-bottom: 25px;">
В этой задаче нужно написать полноценную Java-программу с точкой входа <code>main</code>.
</p>

<div style="background: #e8f4fd; border-left: 4px solid #3498db; padding: 15px; margin: 20px 0;">
<h3 style="color: #2980b9; margin-top: 0;">Цель задачи</h3>
<p>Закрепить базовую структуру Java-программы: класс <code>Main</code> и метод <code>main</code>.</p>
</div>

<h2 style="color: #34495e;">Условие</h2>

<p>Напишите программу, которая выводит две строки:</p>

<pre style="background: #2c3e50; color: #ecf0f1; padding: 15px; border-radius: 8px; overflow-x: auto;"><code>Hello Kata Academy!
Hello from my first Java program!</code></pre>

<h2 style="color: #34495e;">Требования</h2>

<ul style="line-height: 1.8;">
  <li>Создайте класс <code>Main</code>.</li>
  <li>Добавьте метод <code>public static void main(String[] args)</code>.</li>
  <li>Используйте две команды <code>System.out.println</code>.</li>
  <li>Не используйте переменные, циклы и дополнительные методы.</li>
</ul>

<h2 style="color: #34495e;">Шаблон</h2>

<pre style="background: #2c3e50; color: #ecf0f1; padding: 15px; border-radius: 8px; overflow-x: auto;"><code>public class Main {
    public static void main(String[] args) {
        // ваш код здесь
    }
}</code></pre>

<div style="background: #fff3cd; border-left: 4px solid #ffc107; padding: 15px; margin: 20px 0;">
<h3 style="color: #856404; margin-top: 0;">Напоминание</h3>
<p><code>main</code> — это место, с которого JVM начинает выполнение программы. Сейчас важно запомнить форму записи, подробности разберём дальше.</p>
</div>

<h2 style="color: #34495e;">Ожидаемый вывод</h2>

<pre style="background: #2c3e50; color: #ecf0f1; padding: 15px; border-radius: 8px; overflow-x: auto;"><code>Hello Kata Academy!
Hello from my first Java program!</code></pre>

<div style="background: #d4edda; border-left: 4px solid #28a745; padding: 15px; margin: 20px 0;">
<h3 style="color: #155724; margin-top: 0;">Что нужно понять</h3>
<p>Полноценная Java-программа начинается с класса, а выполняемый код находится внутри метода <code>main</code>.</p>
</div>

</div>
</div>
<p>&nbsp;</p>
