<p>&nbsp;</p>
<div style="max-width: 900px; margin: 0 auto; padding: 20px; background: #f8f9fa;">
<div style="background: white; padding: 30px; border-radius: 12px; box-shadow: 0 2px 10px rgba(0,0,0,0.1); overflow-x: auto;">

<h1 style="text-align: center; color: #2c3e50; margin-top: 0;">Задача 1.7: Стартуем</h1>

<div style="background: #e8f5e9; border: 2px solid #4caf50; border-radius: 8px; padding: 14px; margin: 20px 0;">
<h3 style="color: #2e7d32; margin-top: 0;">📌 Цель задачи</h3>
<p style="margin: 0;">Потренироваться писать несколько команд вывода внутри метода <code>main</code> и управлять пустой строкой в консоли.</p>
</div>

<div style="background: linear-gradient(to right, #ffeaa7, #fdcb6e); border-radius: 8px; padding: 16px; margin: 20px 0;">
<h3 style="color: #2d3436; margin-top: 0;">🎯 Сценарий</h3>
<p style="margin-bottom: 10px;">Вы оформляете стартовый экран учебной консольной программы: название курса, название модуля и короткое сообщение.</p>
<p style="margin: 0;"><strong>Ваша задача:</strong> вывести несколько строк в точном порядке, включая пустую строку между блоками.</p>
</div>

<h2 style="color: #34495e; margin-top: 28px;">💡 Что нужно знать</h2>

<div style="background: #f0f4f8; border-radius: 8px; padding: 16px; margin: 16px 0;">
<h4 style="color: #455a64; margin-top: 0;">Порядок выполнения команд</h4>
<p>Команды внутри <code>main</code> выполняются сверху вниз. Каждая команда <code>System.out.println</code> завершает текущую строку.</p>
<pre style="background: #263238; color: #aed581; padding: 12px; border-radius: 4px; margin: 10px 0;"><code>System.out.println("первая строка");
System.out.println();
System.out.println("третья строка");</code></pre>
<p style="margin-bottom: 0;">Пустую строку можно вывести отдельным вызовом <code>System.out.println()</code>.</p>
</div>

<h2 style="color: #34495e; margin-top: 28px;">📋 Техническое задание</h2>
<p><strong>Напишите программу, которая выводит:</strong></p>

<pre style="background: #2c3e50; color: #ecf0f1; padding: 16px; border-radius: 8px; overflow-x: auto;"><code>=== Java Base ===
Модуль 1: Введение в программирование

Стартуем!</code></pre>

<h2 style="color: #34495e; margin-top: 28px;">🎯 Результат программы</h2>
<p>После запуска должен появиться такой блок текста:</p>

<pre style="background: #2c3e50; color: #ecf0f1; padding: 16px; border-radius: 8px; overflow-x: auto;"><code>=== Java Base ===
Модуль 1: Введение в программирование

Стартуем!</code></pre>

<div style="background: #fff3e0; border: 1px solid #ff9800; border-radius: 8px; padding: 14px; margin: 16px 0;">
<h4 style="color: #e65100; margin-top: 0;">🤔 Момент для размышления</h4>
<p style="margin-bottom: 0;">Почему пустая строка тоже считается частью результата программы? Что увидит пользователь, если её убрать?</p>
</div>

<h2 style="color: #34495e; margin-top: 28px;">📝 Структура программы</h2>
<pre style="background: #263238; color: #aed581; padding: 20px; border-radius: 8px; overflow-x: auto;"><code>public class Main {
    public static void main(String[] args) {
        // 1. Выведите заголовок курса
        // 2. Выведите название модуля
        // 3. Выведите пустую строку
        // 4. Выведите финальное сообщение
    }
}</code></pre>

<h2 style="color: #34495e; margin-top: 28px;">✅ Чек-лист проверки</h2>
<div style="background: #f8f9fa; border-left: 4px solid #28a745; padding: 16px; margin: 16px 0;">
<ul style="margin-bottom: 0;">
	<li>☐ Есть класс <code>Main</code> и метод <code>main</code></li>
	<li>☐ Все команды вывода находятся внутри <code>main</code></li>
	<li>☐ Первая строка: <code>=== Java Base ===</code></li>
	<li>☐ Между второй и четвертой строкой есть пустая строка</li>
	<li>☐ Вывод совпадает с образцом полностью</li>
</ul>
</div>

<div style="background: #fff8e1; border-left: 4px solid #ffc107; padding: 16px; margin: 16px 0;">
<h4 style="color: #f57c00; margin-top: 0;">⚠️ Технические ограничения</h4>
<ul style="margin-bottom: 0;">
	<li>Не используйте переменные и дополнительные методы</li>
	<li>Не выводите весь текст одной строкой с ручными переносами</li>
	<li>Не используйте циклы: порядок строк сейчас нужно увидеть явно</li>
	<li>Откажитесь от лишних комментариев в выводе программы</li>
</ul>
</div>

<div style="background: #ffebee; border: 1px solid #ef5350; border-radius: 8px; padding: 14px; margin: 20px 0;">
<h4 style="color: #c62828; margin-top: 0;">🐛 Отладка: если что-то не работает</h4>
<table style="width: 100%; margin-top: 10px;">
	<tbody>
		<tr><td style="padding: 8px; vertical-align: top;"><strong>Нет пустой строки?</strong></td><td style="padding: 8px;">→ Добавьте отдельный <code>System.out.println()</code></td></tr>
		<tr style="background: #ffebee;"><td style="padding: 8px; vertical-align: top;"><strong>Строки перепутаны?</strong></td><td style="padding: 8px;">→ Команды должны идти в том же порядке, что и ожидаемый вывод</td></tr>
		<tr><td style="padding: 8px; vertical-align: top;"><strong>Проверка не принимает ответ?</strong></td><td style="padding: 8px;">→ Сравните пробелы, знаки <code>=</code>, двоеточие и восклицательный знак</td></tr>
	</tbody>
</table>
</div>

<div style="background: #e8f5e9; border: 1px solid #4caf50; border-radius: 8px; padding: 14px; margin: 20px 0;">
<h4 style="color: #2e7d32; margin-top: 0;">💪 Дополнительный вызов (после сдачи задачи)</h4>
<p style="margin-bottom: 0;">Сделайте локально версию с двумя пустыми строками и посмотрите, как меняется читаемость вывода. Перед отправкой оставьте ровно одну пустую строку из задания.</p>
</div>

<div style="background: #f3e5f5; border: 1px solid #ce93d8; border-radius: 8px; padding: 14px; margin: 20px 0;">
<h4 style="color: #6a1b9a; margin-top: 0;">🎨 Где это пригодится</h4>
<p><strong>Сегодня:</strong> Вы научитесь оформлять консольный вывод так, чтобы его было удобно читать.</p>
<p><strong>В проектах:</strong> Заголовки и пустые строки делают отчёты, меню и логи понятнее.</p>
<p style="margin-bottom: 0;"><strong>Дальше в курсе:</strong> Такой вывод пригодится в задачах с условиями, циклами, таблицами и результатами вычислений.</p>
</div>

</div>
</div>
<p>&nbsp;</p>
