<p>&nbsp;</p>
<div style="max-width: 900px; margin: 0 auto; padding: 20px; background: #f8f9fa;">
<div style="background: white; padding: 30px; border-radius: 12px; box-shadow: 0 2px 10px rgba(0,0,0,0.1); overflow-x: auto;">

<h1 style="text-align: center; color: #2c3e50; margin-top: 0;">Задача 1.8: print и println</h1>

<div style="background: #e8f5e9; border: 2px solid #4caf50; border-radius: 8px; padding: 14px; margin: 20px 0;">
<h3 style="color: #2e7d32; margin-top: 0;">📌 Цель задачи</h3>
<p style="margin: 0;">Увидеть разницу между <code>System.out.print</code> и <code>System.out.println</code>: выводом без переноса и выводом с переносом строки.</p>
</div>

<div style="background: linear-gradient(to right, #ffeaa7, #fdcb6e); border-radius: 8px; padding: 16px; margin: 20px 0;">
<h3 style="color: #2d3436; margin-top: 0;">🎯 Сценарий</h3>
<p style="margin-bottom: 10px;">Вы собираете маленький демонстрационный вывод, где одна фраза продолжается в той же строке, а другая начинается с новой.</p>
<p style="margin: 0;"><strong>Ваша задача:</strong> подобрать <code>print</code> и <code>println</code> так, чтобы переносы строк совпали с образцом.</p>
</div>

<h2 style="color: #34495e; margin-top: 28px;">💡 Что нужно знать</h2>

<div style="background: #f0f4f8; border-radius: 8px; padding: 16px; margin: 16px 0;">
<h4 style="color: #455a64; margin-top: 0;">Два способа вывода</h4>
<pre style="background: #263238; color: #aed581; padding: 12px; border-radius: 4px; margin: 10px 0;"><code>System.out.println("текст"); // выводит текст и переносит строку
System.out.print("текст");   // выводит текст без переноса строки</code></pre>
<p style="margin-bottom: 0;">Если после <code>print</code> вызвать <code>println</code>, следующий текст продолжится в той же строке, а перенос произойдёт после <code>println</code>.</p>
</div>

<h2 style="color: #34495e; margin-top: 28px;">📋 Техническое задание</h2>
<p><strong>Напишите программу, которая выводит:</strong></p>

<pre style="background: #2c3e50; color: #ecf0f1; padding: 16px; border-radius: 8px; overflow-x: auto;"><code>println переносит строку
print не переносит строку -> продолжение
Java поддерживает оба способа!</code></pre>

<h2 style="color: #34495e; margin-top: 28px;">🎯 Результат программы</h2>
<p>После запуска вывод должен выглядеть так:</p>

<pre style="background: #2c3e50; color: #ecf0f1; padding: 16px; border-radius: 8px; overflow-x: auto;"><code>println переносит строку
print не переносит строку -> продолжение
Java поддерживает оба способа!</code></pre>

<div style="background: #fff3e0; border: 1px solid #ff9800; border-radius: 8px; padding: 14px; margin: 16px 0;">
<h4 style="color: #e65100; margin-top: 0;">🤔 Момент для размышления</h4>
<p style="margin-bottom: 0;">Почему две команды могут сформировать одну строку вывода? В какой момент консоль переходит на следующую строку?</p>
</div>

<h2 style="color: #34495e; margin-top: 28px;">📝 Структура программы</h2>
<pre style="background: #263238; color: #aed581; padding: 20px; border-radius: 8px; overflow-x: auto;"><code>public class Main {
    public static void main(String[] args) {
        // 1. Выведите первую строку через println
        // 2. Начните вторую строку через print
        // 3. Продолжите вторую строку через println
        // 4. Выведите третью строку
    }
}</code></pre>

<h2 style="color: #34495e; margin-top: 28px;">✅ Чек-лист проверки</h2>
<div style="background: #f8f9fa; border-left: 4px solid #28a745; padding: 16px; margin: 16px 0;">
<ul style="margin-bottom: 0;">
	<li>☐ Есть хотя бы один <code>System.out.println</code></li>
	<li>☐ Есть хотя бы один <code>System.out.print</code></li>
	<li>☐ Вторая строка состоит из двух частей, но выводится в одну строку</li>
	<li>☐ Всего в результате три строки</li>
	<li>☐ Текст и символы <code>-></code> совпадают с образцом</li>
</ul>
</div>

<div style="background: #fff8e1; border-left: 4px solid #ffc107; padding: 16px; margin: 16px 0;">
<h4 style="color: #f57c00; margin-top: 0;">⚠️ Технические ограничения</h4>
<ul style="margin-bottom: 0;">
	<li>Не используйте переменные, циклы и дополнительные методы</li>
	<li>Не выводите весь текст одной командой</li>
	<li>Не заменяйте все команды на <code>println</code>: задача именно про различие двух способов вывода</li>
	<li>Откажитесь от ручного символа <code>\n</code> в этой задаче</li>
</ul>
</div>

<div style="background: #ffebee; border: 1px solid #ef5350; border-radius: 8px; padding: 14px; margin: 20px 0;">
<h4 style="color: #c62828; margin-top: 0;">🐛 Отладка: если что-то не работает</h4>
<table style="width: 100%; margin-top: 10px;">
	<tbody>
		<tr><td style="padding: 8px; vertical-align: top;"><strong>Вторая строка разбилась?</strong></td><td style="padding: 8px;">→ Первая часть второй строки должна выводиться через <code>print</code></td></tr>
		<tr style="background: #ffebee;"><td style="padding: 8px; vertical-align: top;"><strong>Третья строка прилипла?</strong></td><td style="padding: 8px;">→ Вторая часть второй строки должна завершаться через <code>println</code></td></tr>
		<tr><td style="padding: 8px; vertical-align: top;"><strong>Проверка не принимает?</strong></td><td style="padding: 8px;">→ Проверьте пробелы вокруг стрелки <code>-></code></td></tr>
	</tbody>
</table>
</div>

<div style="background: #e8f5e9; border: 1px solid #4caf50; border-radius: 8px; padding: 14px; margin: 20px 0;">
<h4 style="color: #2e7d32; margin-top: 0;">💪 Дополнительный вызов (после сдачи задачи)</h4>
<p style="margin-bottom: 0;">Попробуйте временно заменить все <code>print</code> на <code>println</code> и сравните результат. Затем верните решение к точному образцу.</p>
</div>

<div style="background: #f3e5f5; border: 1px solid #ce93d8; border-radius: 8px; padding: 14px; margin: 20px 0;">
<h4 style="color: #6a1b9a; margin-top: 0;">🎨 Где это пригодится</h4>
<p><strong>Сегодня:</strong> Вы научитесь управлять тем, где начинается и заканчивается строка вывода.</p>
<p><strong>В проектах:</strong> <code>print</code> удобен для приглашений вроде <code>Введите имя: </code>, а <code>println</code> — для готовых сообщений и логов.</p>
<p style="margin-bottom: 0;"><strong>Дальше в курсе:</strong> Это пригодится при выводе меню, таблиц, результатов циклов и интерактивных подсказок.</p>
</div>

<div style="background: #e8f5e9; border: 1px solid #4caf50; border-radius: 8px; padding: 14px; margin: 20px 0;">
<h4 style="color: #2e7d32; margin-top: 0;">Критерии приёмки</h4>
<p style="margin-bottom: 0;">Решение считается верным, если результат совпадает с примерами, соблюдены технические ограничения и выполнены пункты чек-листа.</p>
</div>

</div>
</div>
<p>&nbsp;</p>
