<p>&nbsp;</p>
<div style="max-width: 900px; margin: 0 auto; padding: 20px; background: #f8f9fa;">
<div style="background: white; padding: 30px; border-radius: 12px; box-shadow: 0 2px 10px rgba(0,0,0,0.1); overflow-x: auto;">

<h1 style="color: #2c3e50; border-bottom: 3px solid #3498db; padding-bottom: 10px;">Задача 1.9: Экранирование строк</h1>

<p style="font-size: 18px; color: #555; margin-bottom: 25px;">
В этой задаче нужно вывести текст, внутри которого есть кавычки, обратные слэши и специальные символы.
</p>

<div style="background: #e8f4fd; border-left: 4px solid #3498db; padding: 15px; margin: 20px 0;">
<h3 style="color: #2980b9; margin-top: 0;">Цель задачи</h3>
<p>Научиться использовать экранирование в строках Java.</p>
</div>

<h2 style="color: #34495e;">Условие</h2>

<p>Напишите программу, которая выводит:</p>

<pre style="background: #2c3e50; color: #ecf0f1; padding: 15px; border-radius: 8px; overflow-x: auto;"><code>Он сказал: "Hello, Java!"
Путь: C:\Java\bin
Перенос строки записывается как: \n</code></pre>

<h2 style="color: #34495e;">Требования</h2>

<ul style="line-height: 1.8;">
  <li>Создайте класс <code>Main</code>.</li>
  <li>Добавьте метод <code>public static void main(String[] args)</code>.</li>
  <li>Используйте <code>System.out.println</code>.</li>
  <li>Используйте экранирование для кавычек: <code>\"</code>.</li>
  <li>Используйте экранирование для обратного слэша: <code>\\</code>.</li>
  <li>Не используйте переменные и дополнительные методы.</li>
</ul>

<h2 style="color: #34495e;">Подсказка</h2>

<pre style="background: #2c3e50; color: #ecf0f1; padding: 15px; border-radius: 8px; overflow-x: auto;"><code>System.out.println("Он сказал: \"Hello!\"");
System.out.println("Путь: C:\\Java");</code></pre>

<div style="background: #fff3cd; border-left: 4px solid #ffc107; padding: 15px; margin: 20px 0;">
<h3 style="color: #856404; margin-top: 0;">Важно</h3>
<p>Строки в Java записываются в двойных кавычках. Если двойная кавычка должна быть частью текста, перед ней ставят обратный слэш.</p>
</div>

<h2 style="color: #34495e;">Ожидаемый вывод</h2>

<pre style="background: #2c3e50; color: #ecf0f1; padding: 15px; border-radius: 8px; overflow-x: auto;"><code>Он сказал: "Hello, Java!"
Путь: C:\Java\bin
Перенос строки записывается как: \n</code></pre>

<div style="background: #d4edda; border-left: 4px solid #28a745; padding: 15px; margin: 20px 0;">
<h3 style="color: #155724; margin-top: 0;">Что нужно понять</h3>
<p>Экранирование позволяет вывести символы, которые иначе Java восприняла бы как часть синтаксиса программы.</p>
</div>

</div>
</div>
<p>&nbsp;</p>
