<p>&nbsp;</p>
<div style="max-width: 900px; margin: 0 auto; padding: 20px; background: #f8f9fa;">
<div style="background: white; padding: 30px; border-radius: 12px; box-shadow: 0 2px 10px rgba(0,0,0,0.1); overflow-x: auto;">

<h1 style="color: #2c3e50; border-bottom: 3px solid #3498db; padding-bottom: 10px;">Задача 2.1: Объявление переменных</h1>

<div style="background: #e8f5e9; border: 2px solid #4caf50; border-radius: 8px; padding: 14px; margin: 20px 0;">
<h3 style="color: #2e7d32; margin-top: 0;">📌 Цель задачи</h3>
<p style="margin: 0;">Научиться объявлять переменные с явным указанием типа в Java.</p>
</div>

<h2 style="color: #34495e;">Условие</h2>
<p>Напишите программу, которая объявляет переменные:</p>
<ul>
	<li><code>age</code> типа <code>int</code> со значением <code>25</code></li>
	<li><code>name</code> типа <code>String</code> со значением <code>"Alice"</code></li>
	<li><code>height</code> типа <code>double</code> со значением <code>1.75</code></li>
	<li><code>isStudent</code> типа <code>boolean</code> со значением <code>true</code></li>
</ul>

<h2 style="color: #34495e;">Что вывести</h2>
<p>Выведите значения переменных, каждое с новой строки.</p>

<pre style="background: #2c3e50; color: #ecf0f1; padding: 15px; border-radius: 8px; overflow-x: auto;"><code>25
Alice
1.75
true</code></pre>

<h2 style="color: #34495e;">Требования</h2>
<ul>
	<li>Программа должна содержать класс <code>Main</code>.</li>
	<li>Код должен быть внутри метода <code>main</code>.</li>
	<li>Используйте явные типы: <code>int</code>, <code>String</code>, <code>double</code>, <code>boolean</code>.</li>
	<li>Для вывода используйте <code>System.out.println</code>.</li>
	<li>Лишнего вывода быть не должно.</li>
</ul>

<div style="background: #fff3cd; border-left: 4px solid #ffc107; padding: 15px; margin: 20px 0;">
<h3 style="color: #856404; margin-top: 0;">Подсказка</h3>
<pre style="background: #1e293b; color: #e2e8f0; padding: 12px; border-radius: 5px;"><code>int age = 25;
System.out.println(age);</code></pre>
</div>

</div>
</div>
<p>&nbsp;</p>
